//-----------------------------------------------------------------------------
//
// アイテムの処理
// Author : Yuto Koseki 
//
//-----------------------------------------------------------------------------

#pragma once
#ifndef _ITEM_H_
#define _ITEM_H_

#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define MAX_ITEM (128)		//アイテム数
#define MAX_ITEM_TYPE (2)	//アイテムのタイプ数
#define ITEM_SIZEX (40)		//アイテムの横幅
#define ITEM_SIZEY (60)		//アイテムの立幅
#define ITEM_TIME_SIZEX (30)
#define ITEM_TIME_SIZEY (50)
#define ITEM_SCORE (0)		//スコアアップアイテム
#define ITEM_TIME (1)		//時間延長アイテム

//-----------------------------------------------------------------------------
// 状態
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 構造体
//-----------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	int nType;			//種類
	D3DXCOLOR col;
	bool bUse;			//使用状態
}ITEM;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);
void SetItem(D3DXVECTOR3 pos, int nType,D3DXCOLOR col);
void SetVertexItem(int nIdx);

#endif _ITEM_H_