//-----------------------------------------------------------------------------
//
// タイマーの処理
// Author : Yuto Koseki 
//
//-----------------------------------------------------------------------------

#pragma once

#ifndef _TIME_H_
#define _TIME_H_

#include "main.h"

//-----------------------------------------------------------------------------
// マクロ定義
//-----------------------------------------------------------------------------
#define TIME_SIZEX (30)		//横幅
#define TIME_SIZEY (50)		//縦幅
#define MAX_TIME (3)		//タイマーの桁
#define TIME_STAGE1 (30)	//制限時間
#define TIME_STAGE2 (60)	//制限時間

//-----------------------------------------------------------------------------
// 構造体
//-----------------------------------------------------------------------------
typedef struct
{
	int nTime;
	bool bTimeup;

}TIMER;

//-----------------------------------------------------------------------------
// プロトタイプ宣言
//-----------------------------------------------------------------------------
HRESULT InitTime(void);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);
TIMER *GetTime(void);
void SetTextureTime(int nIdx);

#endif _TIME_H_

